#include<Stdio.h>
#include<windows.h>
int main()
{
	
	int Select = 0; 
	printf("º»°İ ¹Ì¿¬½Ã °ÔÀÓ\n");
	Sleep(800);
	printf("¼¼»óÀÇ ¸ğµç ÀÎ°£µéÀ» ³²³à³ë(¼Ò´Â °Ë¿­) ÇÒ°Í¾øÀÌ È¦·Áº¸ÀÚ.\n");
	Sleep(800);
	
	printf("[Àú ¸Ö¸® ·ùÀ¸¹Ì°¡ Áö³ª°£´Ù.]\n");
	Sleep(800);
	printf("·ùÀ¸¹Ì:·ùÄ£·ùÄ£!\n");
	Sleep(800);
	
	printf("¹«¾ùÀ» ÇÒ±î?\n");
	printf("1:¸Ó¸®¿¡ ºĞÈ«»ö °í¾çÀÌ±Í¸¦ ´Ş¸ç ¾Ö±³¸¦ ¶²´Ù.\n");
	printf("2:±×³É Àç¹Ì¾ø´Â À¯È¤À» ÇÑ´Ù.\n");
	Sleep(800);
	
	scanf("%d", &Select);
	if(Select == 1){
		
		printf("·ùÀ¸¹Ì:º½..¿©¿ì..?\n");
		Sleep(800);
		printf("[·ùÀ¸¹Ì°¡ ¹ÌÃÄ ¹ß±¤ÇØ ¹ö·È´Ù]\n");
		Sleep(800);
		main();
	}
	else{
		
		printf("·ùÀ¸¹Ì:¿ìÈ÷ÆR! ¿ìÆR! À¯È¤ ÁÁ¾Æ!\n");
		Sleep(800);
		
	}
	printf("[·ùÀ¸¹Ì¸¦ À¯È¤Çß´Ù! ¾ÕÀ¸·Î ·ùÀ¸¹Ì°¡ µû¶ó´Ù´Ñ´Ù.]\n");
	Sleep(800);
	
	printf("[Àú ¸Ö¸® Çüµ¶ÀÌ Áö³ª°£´Ù.]\n");
	Sleep(800);
	printf("Çüµ¶:¿¡¿¡À×~!!\n");
	Sleep(800);
	
	printf("¹«¾ùÀ» ÇÒ±î?\n");
	printf("1:-°¥ºù-\n");
	printf("2:Çüµ¶¿Àºü ¸ÚÁ®¿ä\n");
	Sleep(800);
	
	scanf("%d", &Select);
	if(Select == 1){
		
		printf("Çüµ¶:#%$$@%@#$%!!!!\n");
		Sleep(800);
		printf("[¸®Å¸ÀÌ¾î°¡ È­¸¦ °İÇÏ°Ô ³»°í ÀÖ´Ù.]\n");
		Sleep(800);
		main();
	}
	else{
		
		printf("Çüµ¶:ºÎ²ô·´°Ô..È÷È÷È÷\n");
		Sleep(800);
		
	}
	printf("[Çüµ¶À» À¯È¤Çß´Ù! ¾ÕÀ¸·Î Çüµ¶ÀÌ µû¶ó´Ù´Ñ´Ù.]\n");
	Sleep(800);
	
	
	
	printf("[Àú ¸Ö¸® °ú·Î»ç°¡ Áö³ª°£´Ù.]\n");
	Sleep(800);
	printf("°ú·Î»ç:ÀÌÀÌÀ×~¾Ñ»ì¶ó¸¶ÀÌ²Ş~\n");
	Sleep(800);
	
	printf("¹«¾ùÀ» ÇÒ±î?\n");
	printf("1:…³…³ ÇØÁÖ¼¼¿ä!\n");
	printf("2:10000¿ø ÈÄ¿ø\n");
	Sleep(800);
	
	scanf("%d", &Select);
	if(Select == 1){
		
		printf("°ú·Î»ç:@!#$!$@!#$ Àı´ë¾ÈÇØ !@#!@#¾Æ!\n");
		Sleep(800);
		printf("[°ú·Î»ç°¡ Á¤½ÅÀÌ ³ª°¬´Ù.]\n");
		Sleep(800);
		main();
	}
	else{
		
		printf("°ú·Î»ç:ÀÌÀÌÀÌÀÌÀÌÀÌÀÌÀÌÀ×!!!\n");
		Sleep(800);
		
	}
	
	printf("[°ú·Î»ç¸¦ À¯È¤Çß´Ù! ¾ÕÀ¸·Î °ú·Î»ç°¡ µû¶ó´Ù´Ñ´Ù.]\n");
	Sleep(800);
	
	
	printf("[Àú ¸Ö¸® ¿øÁ¤»óÀÌ Áö³ª°£´Ù.]\n");
	Sleep(800);
	printf("¿øÁ¤»ó:¿À¸£°ñ~¸®¾×¼Ç~\n");
	Sleep(800);
	
	printf("¹«¾ùÀ» ÇÒ±î?\n");
	printf("1:Á¤»ó´Ô Á¦ ÀÌ¸§ ºÒ·¯ÁÖ¼¼¿ä!\n");
	printf("2:Á¤»ó´Ô Àß»ı°å¾î¿ä\n");
	Sleep(800);
	
	scanf("%d", &Select);
	if(Select == 1){
		
		printf("¿øÁ¤»ó:Àë¹ÎÀÌ »õ³¢ @#!#!@\n");
		Sleep(800);
		printf("[¿øÁ¤»óÀÌ ±×Àú -Àë- ¿¡°Ô ºĞ³ëÇÏ°í ÀÖ´Ù]\n");
		Sleep(800);
		main();
	}
	else{
		
		printf("¿øÁ¤»ó:¾Ë°í ÀÖ±¸³ª..? ÇÏÇÏ! ³»°¡ Á» Àß»ı°åÁö!\n");
		Sleep(800);
		
	}
	
	printf("[¿øÁ¤»óÀ» À¯È¤Çß´Ù! ¾ÕÀ¸·Î ¿øÁ¤»óÀÌ µû¶ó´Ù´Ñ´Ù.]\n");
	Sleep(800);
	
	
	printf("[Àú ¸Ö¸® º¸°âÀÌ Áö³ª°£´Ù.]\n");
	Sleep(800);
	printf("º¸°â:¿À¸£°ñ~¸®¾×¼Ç~\n");
	Sleep(800);
	
	printf("¹«¾ùÀ» ÇÒ±î?\n");
	printf("1:º®µ¹ÅÃ¹è º¸³»±â\n");
	printf("2:(¿©ÀÚ ¸ñ¼Ò¸®·Î)º¸°â¿Àºü ¾È³çÇÏ¼¼¿ä?\n");
	Sleep(800);
	
	scanf("%d", &Select);
	if(Select == 1){
		
		printf("º¸°â:º¯È£»ç´Ô Àß Ã³¸® ºÎÅ¹µå¸³´Ï´Ù.\n");
		Sleep(800);
		printf("[°¨¿Á¿¡ µé¾î°¡ ¹ö·È´Ù.]\n");
		Sleep(800);
		main();
	}
	else{
		
		printf("º¸°â:È÷È÷È÷! È÷! È÷È÷!\n");
		Sleep(800);
		
	}
	
	printf("[º¸°âÀ» À¯È¤Çß´Ù! ¾ÕÀ¸·Î º¸°âÀÌ µû¶ó´Ù´Ñ´Ù.]\n");
	Sleep(800);
	
	
	
	printf("[Àú ¸Ö¸® ÇÑÇı¿¬ÀÌ Áö³ª°£´Ù.]\n");
	Sleep(800);
	printf("ÇÑÇı¿¬:ÁË¼ÛÇÕ´Ï´Ù.\n");
	Sleep(800);
	
	printf("¹«¾ùÀ» ÇÒ±î?\n");
	printf("1:»ç¶ûÇØ¿ä ´©³ª\n");
	printf("2:ÀÌ°Ç °Å¸¥´Ù.\n");
	Sleep(800);
	
	scanf("%d", &Select);
	if(Select == 1){
		
		printf("ÇÑÇı¿¬:ÁË¼ÛÇÕ´Ï´Ù.\n");
		Sleep(800);
		printf("[ÇÑÇı¿¬°ú °°ÀÌ ÁË¼ÛÇÕ´Ï´Ù¸¦ ¿ÜÄ¡°Ô µÇ¾ú´Ù.]\n");
		Sleep(800);
		main();
	}
	else{
		
		printf("ÁÁÀº ¼±ÅÃÀÌ´Ù.\n");
		Sleep(800);
		
	}
	
	printf("[ÇÑÇıÇöÀ» À¯È¤ÇÏÁö ¸øÇß´Ù! ±×·¯³ª ÁÁÀº ¼±ÅÃÀÎ °Í °°´Ù.]\n");
	Sleep(800);
	
}
